{"title": "New Option After Death: Human Composting", "info": "Human composting involves placing a human corpse in a cylindrical vessel with organic material like wood and alfalfa to speed up decomposition. After a month, the remains are reduced into a rich soil that can be used for planting. ", "question": "Would you vote yes or no on legalization of  human composting as a burial alternative to broaden death care choices? ", "data": [{"text": "This is necessary. We need to explore new ideas like this because of space constraints and environmental concerns. ", "sentiment": "0.3612", "claim": "0.157440475"}, {"text": "A more practical way to deal with human remains. Burial leaches chemicals into the ground, and  cremation releases earth-warming carbon dioxide.", "sentiment": "0", "claim": "0.21765244"}, {"text": "This a less expensive way of dealing with human remains that is better for the environment than burial.", "sentiment": "0.4404", "claim": "0.290403024"}, {"text": "Using humans for compost, might as well join Jeffrey Dahmer for dinner. It creates brain lesions and spongiform in the brain like mad cow disease. ", "sentiment": "0.5719", "claim": "0.304469116"}, {"text": "Human flesh is toxic due to biomagnification. ", "sentiment": "0", "claim": "0.235133634"}, {"text": "That is sick!!! There will be a special section in Hell for these sick people.", "sentiment": "-0.8854", "claim": "0.250761861"}, {"text": "Using  dead human as compost!!!! this goes beyond insanity ", "sentiment": "-0.8798", "claim": "0.251069152"}, {"text": "This is sacrilegious and horrifying and ultimate denial of the soul", "sentiment": "-0.5719", "claim": "0.250084123"}, {"text": "human life is not sacred.  Most people are just stupid pieces of sh*t that would be more useful as compost ", "sentiment": "-0.0534", "claim": "0.206557516"}, {"text": "Most horrific scifi is becoming reality. ", "sentiment": "-0.6901", "claim": "0.314568497"}, {"text": "What’s magical is that we cease to be human during this process. ", "sentiment": "0", "claim": "0.209780228"}, {"text": "Hey everyone: human heads go in the compost, not the recycling.", "sentiment": "0", "claim": "0.172124921"}, {"text": "This will change the world! An environmentally friendly alternatives to traditional burial practices.", "sentiment": "0.5411", "claim": "0.161742239"}, {"text": "That reflects a mechanistic view of humankind, in which we are no different from dogs or monkeys, or for that matter, garbage from last night’s supper thrown into a compost pile. ", "sentiment": "-0.2732", "claim": "0.284988411"}, {"text": "Burial ceremonies took place for a reason. It is to pay homage, or at least respect, to the deceased, to honor the gods, to provide what was once called “a decent burial.”", "sentiment": "0.7096", "claim": "0.251976903"}, {"text": "So basically life is meaningless and history pointless.", "sentiment": "-0.4404", "claim": "0.270966432"}, {"text": "Proper and traditional burial provides the framework where loved ones can fulfill their responsibilities to the dead. ", "sentiment": "0.3612", "claim": "0.215141591"}, {"text": "That is commodification of human beings. Treating us as nothing but livestock.", "sentiment": "0", "claim": "0.229206294"}, {"text": "This is gross. this is not God's will, or He would have made it clear to us in His Word that this is what we are to do.", "sentiment": "-0.128", "claim": "0.184521505"}, {"text": "when human life is deemed disposable through abortion and euthanasia, the human corpse fares no better.", "sentiment": "-0.4588", "claim": "0.176204946"}, {"text": "The practice of human composting is but a symptom of the march toward secularism. it is the responsibility of people of faith to resist the effort to minimize the spirit and soul of man.", "sentiment": "0.6956", "claim": "0.1959983"}, {"text": "the right to bury our loved ones came from unwritten and unchanging laws. They are not just for today or yesterday but exist forever, and no one knows where they first appeared.", "sentiment": "-0.09", "claim": "0.285375385"}, {"text": "This is not right. The body is sacred and must be treated with all due dignity and respect. It has always been this way.", "sentiment": "0.7003", "claim": "0.16661977"}, {"text": "Right?! Ughhh.....! Between this, the abortion after birth, and then using human cadavers as actual COMPOST, I can't... My life is surely half over & if it weren't for my child, I'd just give up, lol! I laugh, only bc of the pure disbelief & absurdity of it ALL!", "sentiment": "0.8877", "claim": "0.14547536"}, {"text": "Ironic… we are elevating animals by pretending they have human thoughts while simultaneously denigrating human life to the compost pile", "sentiment": "0.1027", "claim": "0.262359332"}, {"text": "we have lost the traditional sense of respect for our dead", "sentiment": "-0.5423", "claim": "0.220420214"}, {"text": "they want to turn Grannie into compost", "sentiment": "0.0772", "claim": "0.129280381"}, {"text": "Nature knows how to transform our bodies to soil all on its own", "sentiment": "0", "claim": "0.092517969"}, {"text": "We have all this energy and potential that's either burned up or sealed away in burials, when it could be utilized to let life go on ", "sentiment": "0.3346", "claim": "0.179655047"}, {"text": "What's most important to me is that after I'm gone, my body is able to give back to this earth that has supported me, and through that create new life ", "sentiment": "0.6697", "claim": "0.185373315"}, {"text": "It's the only way to go. Waters near cemeteries are polluted with embalming carcinogens and as long as you didn't die of Ebola, your body is not a risk to the living.", "sentiment": "0.2406", "claim": "0.279216971"}, {"text": "That is so comforting and natural. I always hoped that after death my remains would be reduced to soil and spread around to help out some flowers, or a tree", "sentiment": "0.7687", "claim": "0.218207806"}, {"text": "Ew…I don’t know about that! Composting makes me think of banana peels and coffee grounds", "sentiment": "0", "claim": "0.153124524"}, {"text": "Seems very practical to me. our bodies have nutrients. we grow new life after we’ve died. ", "sentiment": "-0.5574", "claim": "0.207299992"}, {"text": "It certainly is feasible that families would take home a small portion that they could keep for a long time, Or families could bring home a small amount that would be interred into their landscape, placed under a loved one’s favorite tree, similar to what people do with cremains.", "sentiment": "0.8519", "claim": "0.474329005"}, {"text": "This is not simply a process to convert bodies to soil; it’s also about bringing ritual and some of that ceremony back", "sentiment": "0", "claim": "0.158938277"}, {"text": "What I think is remarkable is that this universal, human experience of death remains almost untouched by technology", "sentiment": "-0.0772", "claim": "0.156768829"}, {"text": "I think it a great alternative. Just think about cremation, even when you’re dead it feels so violent to be burned in the oven. And with burial you’re filled with chemicals and put in several boxes in the ground and I always knew I didn’t want to do that", "sentiment": "-0.7088", "claim": "0.172764402"}, {"text": "Super! who doesn’t want to be laid to rest in alfalfa? ", "sentiment": "0.6696", "claim": "0.171111578"}, {"text": "That’s outrageous. A pile of bodies is usually called a ‘mass grave.’ Please stop what you’re doing.", "sentiment": "-0.4404", "claim": "0.259566461"}, {"text": "A traditional burial with a plot of land, headstone and maintenance for the next 1000 years is something that most people(and cemeteries) are no longer able to afford. With over 7 billion people dying in the next 100 years this is something that is necessary to use resources responsibly.", "sentiment": "-0.296", "claim": "0.490113077"}, {"text": "This process uses less energy and produce significantly less carbon dioxide than traditional burial and cremation practices.", "sentiment": "0.204", "claim": "0.435252475"}, {"text": "This makes more sensible. All energy is only borrowed, eventually you have to give it back.", "sentiment": "0.3321", "claim": "0.193755358"}, {"text": "Already countless farms across the country, compost the bodies of dead livestock. In some places, transportation departments compost roadkill.", "sentiment": "-0.6486", "claim": "0.298446186"}, {"text": "plain stupid. human bodies  are toxic. I read somewhere that human remains nowadays aren't decomposing as fast as they did a few decades ago, because of all the chemicals inside, they should be handled as special waste", "sentiment": "-0.5423", "claim": "0.254722764"}, {"text": "As long as it's the wishes of the deceased, I have no issue with it. As in life, so to in death: Their Body, Their Choice.", "sentiment": "-0.6969", "claim": "0.225867426"}, {"text": "Ashes to ashes, Dust to dust, Compost to compost.", "sentiment": "0", "claim": "0.140509673"}, {"text": "Because everyone's dream is to come back as someone's zucchini", "sentiment": "0.25", "claim": "0.104827718"}, {"text": "Beyond the environmental benefits to composting humans, there is a spiritual one: connecting death to the cycle of nature will help people face their own mortality and bring comfort to the bereaved.", "sentiment": "-0.0516", "claim": "0.256579158"}, {"text": "Burying our dead means more than you know. Burying our dead, let alone mourning our dead in general, is a cornerstone of our society. It’s because we value our lives and the lives of those around us.", "sentiment": "-0.9468", "claim": "0.269947694"}, {"text": "I don’t see the point. Cemeteries are a good way to preserve land in the US.  Cemeteries become permanent green spaces in perpetuity while also giving people a place to confront their own mortality.", "sentiment": "0.5574", "claim": "0.29136092"}, {"text": "I’m all for it. Composting system turns bodies into rich soil that can go back to loved ones and the community.", "sentiment": "0.8176", "claim": "0.283016749"}, {"text": "Conventional burial is anything but natural. Cadavers are preserved with embalming fluid containing formaldehyde, a carcinogen. They are buried in caskets made of metal or wood, and placed inside a concrete or metal burial vault.", "sentiment": "0.5023", "claim": "0.33014983"}, {"text": "Hehe. Dehydrate them first so people think they found Bigfoot remains. It will be more fun for the community that way", "sentiment": "0.5563", "claim": "0.206243069"}, {"text": "Eww! What about the infections and diseases people die from? Won’t those be transferred to the soil? I vote no.", "sentiment": "-0.7752", "claim": "0.187231874"}, {"text": "From my rotting body, flowers shall grow and I am in them and that is eternity.", "sentiment": "0", "claim": "0.173710537"}, {"text": "Give your loved ones a proper Christian-burial. Don't buy into this new-aged BS, you'll regret it! ", "sentiment": "0.3382", "claim": "0.197481681"}, {"text": "Grow marijuana on me then smoke me as you lament, laugh hysterically, and munch Doritos.", "sentiment": "0.1531", "claim": "0.22226268"}, {"text": "Human beings are hosts for all matter of viruses, bacteria and disease, which if not properly managed can contaminate the soil. Mortuary science moved us to a point where we protect the living from the dead. This generation is so ignorant of history and general knowledge they think every “green” idea hasn’t been tried before.", "sentiment": "-0.6532", "claim": "0.326024319"}, {"text": "Human bodies take a while to decompose. Also... We fucking stink. Horribly. I feel like eventually it would get backed up.", "sentiment": "-0.6214", "claim": "0.259874407"}, {"text": "I would feel weird about making a garden using compost made of human remains.", "sentiment": "-0.1779", "claim": "0.213661792"}, {"text": "Yes!...composting would be more beneficial than burning.", "sentiment": "0.54", "claim": "0.328789075"}, {"text": "I produce compost in the WC too", "sentiment": "0", "claim": "0.155746048"}, {"text": "Awesome idea! I remember reading in Dune where people were buried under a sapling. So their cemetery was also an orchard. ", "sentiment": "0.6588", "claim": "0.308076293"}, {"text": "Idiotic! composting gives off methane as a byproduct. this trades CO2 for methane, which is a more potent greenhouse gas", "sentiment": "-0.5983", "claim": "0.208858393"}, {"text": "I want this too and I used to think that those pods were you put the cremains in were really cool. Turns out cremains are horrible fertilizers ", "sentiment": "-0.1548", "claim": "0.221077962"}, {"text": "Idiotic.... biohazard and disease. Humanity survived this already.", "sentiment": "0.5106", "claim": "0.230250775"}, {"text": "If we didn’t bury our dead, or acknowledged them after their demise, we would be a society in which death means nothing. If death means nothing, then the society founded around an ideal such as that would probably be bleak and meaningless.", "sentiment": "-0.9118", "claim": "0.171144365"}, {"text": "outrageously stupid ideas! That makes it impossible to investigate criminal killers victims!!!", "sentiment": "-0.9499", "claim": "0.236040054"}, {"text": "In truth, composting is an ancient and basic method of body disposal. A corpse in the ground without embalming chemicals or a coffin, or in a quickly biodegradable coffin, becomes soil over time.", "sentiment": "-0.34", "claim": "0.261503895"}, {"text": "It is a startling next step in the natural burial movement. Even as more people opt for interment in simple shrouds or biodegradable caskets, urban cemeteries continue to fill up. For the environmentally conscious, cremation is a problematic option, as the process releases greenhouse gases.", "sentiment": "-0.0258", "claim": "0.306542671"}, {"text": "It says a lot about our current culture regarding death that allowing nature to take its course is a \"new\" option.", "sentiment": "-0.5994", "claim": "0.263086482"}, {"text": "It sure is sensible but creepy.", "sentiment": "0.1655", "claim": "0.165354609"}, {"text": "It’s a business....", "sentiment": "0", "claim": "0.269736256"}, {"text": "It’s symbolic to remember those who are lost. The pyramids are also an enormous waste of space but symbolic nonetheless. Technically nature is taking its course when you are buried.", "sentiment": "-0.3716", "claim": "0.223914915"}, {"text": "it's poetic. in a way, you came from the earth and then you are returned to the earth", "sentiment": "0", "claim": "0.244710554"}, {"text": "ugh…Just launch my corpse into the sun, thanks", "sentiment": "-0.2023", "claim": "0.168688375"}, {"text": "Just seems wasteful. I read an article that said on average a human body could produce about 3 square feet of compost. Worldwide about 55 million people die per year, so that's potentially like 165 million sqft of compost per year.", "sentiment": "-0.2815", "claim": "0.494863589"}, {"text": "Just throw me in the trash. When you're dead, you're dead.", "sentiment": "-0.8625", "claim": "0.168080535"}, {"text": "This  turns my stomach… this is a violation of our cultural and religious norms.", "sentiment": "-0.4939", "claim": "0.210076079"}, {"text": "Most of the world already prefers cremation burials, particularly in urban centres faced with ever-decreasing space.", "sentiment": "0", "claim": "0.305807458"}, {"text": "Muslims already bury this way... Without coffins and without embalming...", "sentiment": "0", "claim": "0.184357815"}, {"text": "My only fear is that it would somehow get into the drinking water.", "sentiment": "-0.4939", "claim": "0.230259557"}, {"text": "Now this here well now this here just makes me real sick. It ain't right. This is not how humans are supposed to be remembered. We are suppose to be in a box, 6 feet under earth, with a stone above us. Gross. ", "sentiment": "-0.6486", "claim": "0.224340792"}, {"text": "Our treatment of human remains is a measure of our society’s respect for the deceased. Burial has long been considered an appropriate method of delivering the body to its final resting place, in accordance with tradition, custom and faith. ", "sentiment": "0.7096", "claim": "0.31440789"}, {"text": "People are drawn to the idea of aboveground decomposition mainly for environmental reasons. There’s no coffin, no chemicals, none of the fossil fuels that would be needed for cremation, and no expensive cemetery plot required. ", "sentiment": "-0.6808", "claim": "0.368670488"}, {"text": "This makes burial more inclusive. Some religious traditions  favor ideas of simplicity and of earth returning to earth.", "sentiment": "0.4019", "claim": "0.223984533"}, {"text": "People still don’t know that most farming in the US is fertilized with processed human sewage, this is nothing.", "sentiment": "0", "claim": "0.301212955"}, {"text": "If I should die before I wake, all my bone and sinew take. Put them in the compost pile to decompose a little while….When radishes and corn you munch you may be having me for lunch.", "sentiment": "-0.5994", "claim": "0.232224353"}, {"text": "Plant your petunias in granny? Sorry, but composting human remains seems disrespectful to me. It may or may not be a sin but I've never seen a biblical reference to anything but burial. Graves, sepulchres, tombs yes but never compost. ", "sentiment": "0.669", "claim": "0.185195139"}, {"text": "Putting bodies in boxes or burning them is something we invented. People didn’t do it in the beginning of time. Nor do any other animals. ", "sentiment": "0", "claim": "0.247933057"}, {"text": "Sign me up! Why anyone thought an ugly tombstone is a good idea in the first place. ", "sentiment": "-0.1759", "claim": "0.26065562"}, {"text": "So I can be manure while both alive and dead. Thanks.", "sentiment": "0.0516", "claim": "0.213671582"}, {"text": "Ew!!!Some pathogens (like the bacteria that causes anthrax) may be resistant to the composting process", "sentiment": "0", "claim": "0.26346541"}, {"text": "I think this a great alternative. Cemeteries are stupid waste of space.  I really, really don't want a traditional burial.", "sentiment": "-0.4337", "claim": "0.188600484"}, {"text": "It is similar to the process known as water cremation or alkaline hydrolysis. Under that process, already legal is some areas, bodies are dissolved using a mixture of heated water and lye, leaving behind bone fragments and a sterile liquid.", "sentiment": "0.128", "claim": "0.298990257"}, {"text": "The composting or decomposition of human remains is a radical departure from our traditions. ", "sentiment": "0", "claim": "0.180551817"}, {"text": "The idea causes me to fear for humanity. This practice doesn’t offer the respect that is proper for our deceased. ", "sentiment": "-0.0258", "claim": "0.270144304"}, {"text": "The dead are not nearly as much of a risk to health as the living.", "sentiment": "-0.7506", "claim": "0.215484703"}, {"text": "The fact that this was illegal in the first place is absurd. We should not be denied the  the liberty to dispose of bodies simply and efficiently.", "sentiment": "0.6002", "claim": "0.319544898"}, {"text": "The median cost of a burial and viewing ceremony in the US is over $7,000. For a vault, you can add another thousand. Cremations fall closer to $1,100.", "sentiment": "0", "claim": "0.388176705"}, {"text": "A similar method is used to compost livestock. ", "sentiment": "0", "claim": "0.349434241"}, {"text": "the remains may be contaminated with drugs and mercury. I vote no. ", "sentiment": "-0.296", "claim": "0.301402797"}, {"text": "There are options now....but I love the idea of going back to nature. I am sure there will be to be some regulations to make sure we aren’t polluting. I want to become a tree.", "sentiment": "0.8442", "claim": "0.151608556"}, {"text": "There is already a green cemetery in some parts of the county. This is not new. ", "sentiment": "0", "claim": "0.205654877"}, {"text": "Freaky!!!!Think of all that haunted soil!!!!!!", "sentiment": "-0.6449", "claim": "0.356656825"}, {"text": "I love it!!! You can compost your body in in an indoor garden with a honeycomb structure walls. And When it's done, your loved ones take home a pot of soil, not an urn of ash. ", "sentiment": "0.8743", "claim": "0.266977138"}, {"text": "Though the process sounds simple, it would not be cheap. Preliminary estimates suggest that it could cost at least $5,000 — less, perhaps, than an elaborate burial service, but more than the most basic cremation.", "sentiment": "0", "claim": "0.360934915"}, {"text": "We need a new plague.", "sentiment": "0", "claim": "0.143969814"}, {"text": "We need this. Cemetaries are a waste of land", "sentiment": "-0.4215", "claim": "0.164402635"}, {"text": "we’re running out of space for graveyards anyway", "sentiment": "-0.296", "claim": "0.234035646"}, {"text": "Well this is much easier than my original plan of walking around in a forest looking for a cougar or a bear when I get old and depressed.", "sentiment": "0.4404", "claim": "0.247211555"}, {"text": "It’s nothing new. There are place that have been doing this for a good few years now. I love it. Leave nothing behind, and help create new life.", "sentiment": "0.7745", "claim": "0.21048451"}, {"text": "What about a Viking funeral, let’s legalize that too!", "sentiment": "-0.4199", "claim": "0.11697462"}, {"text": "What about mixed into the water supply?", "sentiment": "0", "claim": "0.12453243"}, {"text": "What's wrong with cremation?", "sentiment": "-0.4767", "claim": "0.100694769"}, {"text": "When you die you can grow new life. It’s as simple as that.", "sentiment": "-0.5994", "claim": "0.148063866"}, {"text": "Our traditional burial is expensive and terrible for the planet. I would think a natural burial without any chemicals or caskets would be fine.", "sentiment": "0.0516", "claim": "0.222343913"}, {"text": "Yea sounds like a good way to start a new plague.", "sentiment": "0.6597", "claim": "0.120016128"}, {"text": "You can donate your body to law enforcement. They usually do just that and then document it for forensic study and use later.", "sentiment": "0", "claim": "0.236371899"}, {"text": "you physically stuck on this planet and won't get away. your body will be digested from the nature no matter what you do. this is no unpopular opinion", "sentiment": "-0.6486", "claim": "0.141902414"}, {"text": "You should watch the original Wicker Man from the 70’s. It’s a movie about an island off of Scotland where the inhabitants still practice Celtic pagan religion. When someone dies they plant a tree on their grave and because of this they don’t consider the person dead but just living on as a tree.", "sentiment": "-0.4215", "claim": "0.245493863"}]}